#Для оценки эффекта от выявления виртуальных сообществ в работе алгоритма привлечения пользователей
#на заданный набор страниц с помощью предложения ссылок была построена имитационная модель
#навигации пользователей, основанная на применении аппарата марковских цепей, как и сам алгоритм.
#Результаты ее работы представлены в следующей таблице:

#Прямой показ заданных ссылок без применения алгоритма
#Применение алгоритма без выявления виртуальных сообществ
#Применение алгоритма с выявлением виртуальных сообществ
#Эффективность прилечения пользователей	1.30%	3.50%	7.20%

#Таким образом, имеет смысл рекомендовать в виде ссылок не сами искомые страницы,
#а пользовательские заметки, ссылающиеся на требуемые страницы. Итак, можно сформулировать
#простой критерий отбора ссылок рекомендательного характера:
